poc/consumer/examples/trust-request.xml

<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Header>
		<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="_b77d61d3-8ee4-45f4-a779-5b9dca93ddcf">3485d2d7-416f-4b7a-8a9c-cc2171c09420</wsa:MessageID>
		<sbf:Framework xmlns:NS1="urn:liberty:sb:eGovprofile" xmlns:sbf="urn:liberty:sb:2006-08"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" NS1:profile="urn:liberty:sb:profile:basicegovsimple"
			version="2.0" wsu:Id="_f80bcc13-3b30-45f1-b852-7973541a35a1" />
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			soap11:mustUnderstand="1">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_1ff5685f-6673-4f23-afdd-3dd40336a92a">
				<wsu:Created>2008-11-17T15:56:53.764Z</wsu:Created>
				<wsu:Expires>2008-11-17T16:06:53.764Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="pfx2535b681-793c-5e0a-092a-5992ff6f8cb9"
				IssueInstant="2008-11-17T15:21:11Z" Version="2.0">
				<saml:Issuer>https://saml-perf1.trifork.com/simplesaml/saml2/idp/metadata.php
				</saml:Issuer>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#pfx2535b681-793c-5e0a-092a-5992ff6f8cb9">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>/fii+YSMv7ZmKE0foe3l4i74eAM=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>
						JZsTsYfjBKzQMFF5WPV5N1dgxuga8+NG/O17LHYSZOdBnNaOGf9gUKi4Ef8BGzt4Y/2bObqDW6f15S3TQaWU3thJTBwnsp7unD2rExBpjSRpPAzSTQkU4LsnxGKhTXuPN3ZnvwrTUc4OrK7pR5ZSS++IYhRfCb09TevO3b1cVVE=
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:X509Data>
							<ds:X509Certificate>
								MIICWTCCAcICCQCo2m90N+MndjANBgkqhkiG9w0BAQUFADBxMQswCQYDVQQGEwJESzELMAkGA1UECBMCTUoxDzANBgNVBAcTBkFhcmh1czEQMA4GA1UEChMHVHJpZm9yazERMA8GA1UECxMIU2VydmljZXMxHzAdBgNVBAMTFnNhbWwtcGVyZjEudHJpZm9yay5jb20wHhcNMDgxMTE3MDg0NTEwWhcNMDkwMTE2MDg0NTEwWjBxMQswCQYDVQQGEwJESzELMAkGA1UECBMCTUoxDzANBgNVBAcTBkFhcmh1czEQMA4GA1UEChMHVHJpZm9yazERMA8GA1UECxMIU2VydmljZXMxHzAdBgNVBAMTFnNhbWwtcGVyZjEudHJpZm9yay5jb20wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBALBl4yNF5O1yH9tSSGOVylXMSxhnYvVxu0PAqNwZAcPPlBFdFOSf64j3duaYDKax8Tp/5LKM2CI64tCAH2Ldo89a4TMNIssU2yBCXva+BhsypXWOgPsLP5pxK3AA2DOqCQPSJ/3Ee/XqmzcvOTHwDXBZRcdMOCFV5Up2cnitfEmpAgMBAAEwDQYJKoZIhvcNAQEFBQADgYEAZW+Zo2MIxj4ZW53muNRzOaOBfodOBELd/7wwS0kEmrOQ17xqtPN6GBpNBpyYAIn1G/jHsMMZ9S9GXLWEl3EZCV5nc0fTlrpload6/+f0epxesSyDkuxSEgCxrs0+af+fybikll5jnWsp5msZyjQ3ur2MNyXO00dwuM9GsN4F/qQ=
							</ds:X509Certificate>
						</ds:X509Data>
					</ds:KeyInfo>
				</ds:Signature>
				<saml:Subject>
					<saml:NameID Format="" SPNameQualifier="https://sts.oiosaml.net" />
					<saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
						<saml:SubjectConfirmationData InResponseTo="" NotOnOrAfter="2008-11-17T15:26:11Z"
							Recipient="http://jre-mac.trifork.com:8080/saml/saml/SAMLAssertionConsumer" />
					</saml:SubjectConfirmation>
				</saml:Subject>
				<saml:Conditions NotBefore="2008-11-17T15:20:41Z" NotOnOrAfter="2008-11-17T15:26:11Z">
					<saml:AudienceRestriction>
						<saml:Audience>https://sts.oiosaml.net</saml:Audience>
					</saml:AudienceRestriction>
				</saml:Conditions>
				<saml:AuthnStatement AuthnInstant="2008-11-17T15:21:11Z" SessionIndex="_20508bf9b0f6a2544ec9b9e4e2100615f6688df352">
					<saml:AuthnContext>
						<saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:Password
						</saml:AuthnContextClassRef>
					</saml:AuthnContext>
				</saml:AuthnStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oid:2.5.4.4" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Lohman
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:2.5.4.3" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Fissirul Lohman
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:0.9.2342.19200300.100.1.1" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">lohman
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:0.9.2342.19200300.100.1.3" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">jre@trifork.com
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:SpecVer" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">DK-SAML-2.0
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:2.5.4.10" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string" />
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:2.5.4.5" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">1234</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:IsYouthCert" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">false
						</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:AssuranceLevel" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">3</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:RidNumberIdentifier" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">1234</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:CvrNumberIdentifier" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">1234</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
			</saml:Assertion>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_1ff5685f-6673-4f23-afdd-3dd40336a92a">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>qkFW9sIJe6+Z3szmAKpp7bA6fZ8=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_8b9bfc93-d7fe-45be-833c-548304ea0a8e">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>URlZ/iDC4sW1ErzgfQ4Q9k7RsGY=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_30ec880e-94b2-4b62-8426-1b289a096e24">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>G8ot03G7tUXcDpCXYz+1Uaw3i/Y=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_53fcb23c-48bc-4c30-b048-fe3503a14530">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>GqJS+RpL/RQudBNamfv6IZo67y8=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_f80bcc13-3b30-45f1-b852-7973541a35a1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>fezyZQl0ARrKr/WjOEJ8Rpon/hU=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_b77d61d3-8ee4-45f4-a779-5b9dca93ddcf">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>VjE8WD++2UOUUcFdW7nthIIHxUc=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_1f420876-b1e3-4fc0-b985-b4403e040f4b">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>JZqRpBUSyhcsl41reTUxRwqdWJs=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>ZxNpbfpkqHzzqefVGTqRbrvwA8ISk0IMNa4+9H+Ab4OvtjDJJY6kPoJcVf1j0fZi49U29WSec3Z8
					iRblhzvm7iOe4uMjZ/s/WeQ4Wj1EvXy5MvCqVcgeJ+QwMe9WPPparjKigHhaAFJD10JPAJakwCem lKGJfMJSr1Cd1X78+ZI=</ds:SignatureValue>
				<ds:KeyInfo>
					<ds:X509Data>
						<ds:X509Certificate>MIICKTCCAZKgAwIBAgIGAR2qASy1MA0GCSqGSIb3DQEBBQUAMCoxEzARBgNVBAoMCmtleW1hbmFn
							ZXIxEzARBgNVBAsMCm9pb3NhbWwtc3AwHhcNMDgxMTE3MTAzMTIzWhcNMTgxMTE1MTAzMTIzWjBC
							MSswKQYDVQQDDCJodHRwOi8vc2FtbC5zYW1sLXBlcmYzLnRyaWZvcmsuY29tMRMwEQYDVQQLDApv
							aW9zYW1sLXNwMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCaxS4Jn/kYgDTztJXFxMhfk89L
							5JhDqXEibZX21Ua+ch51GeWEIX1nKwHMp3fPGEEe3nOxAjZ4TZbnz8h5XEF3GP1VkiDzOOpXiXGI
							ja4GKcK0EKcLKyEPbP35cDuOd3UvXfQ/9JN8Hvdh4BYSD9gUObhVr5ksk9RuBkm34bSI6wIDAQAB
							o0IwQDAdBgNVHQ4EFgQUV5yHYw0tqb7N34BEebSerd190q4wHwYDVR0jBBgwFoAUV5yHYw0tqb7N
							34BEebSerd190q4wDQYJKoZIhvcNAQEFBQADgYEAOGaIDQhubbAiyHBGnaxwi7zflnbwgGb7YXGk
							OVAxWQy2yLVcdBd8UNW7Fi1YhAhvq+3rei2mzxW/ykHQCxw7oMD+bvDZEMYD6G1+6SWJULnPiY/s
							hgy5d7UbvOg9IvzVTztqxqZdiqhoG0fsfx183KNmXAK508qnASS0uEAsRCA=</ds:X509Certificate>
					</ds:X509Data>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
		<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="_8b9bfc93-d7fe-45be-833c-548304ea0a8e">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</wsa:Action>
		<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="_53fcb23c-48bc-4c30-b048-fe3503a14530">http://saml-perf1.trifork.com:8080/TokenService/services/Trust
		</wsa:To>
		<wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="_1f420876-b1e3-4fc0-b985-b4403e040f4b">
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</soap11:Header>
	<soap11:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_30ec880e-94b2-4b62-8426-1b289a096e24">
		<wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
			<wst:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0
			</wst:TokenType>
			<wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue
			</wst:RequestType>
			<wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
				<wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing">
					<wsa:Address>http://saml-perf2.trifork.com:8080/poc-provider/ProviderService
					</wsa:Address>
				</wsa:EndpointReference>
			</wsp:AppliesTo>
			<wst:OnBehalfOf>
				<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
					<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
						ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">pfx2535b681-793c-5e0a-092a-5992ff6f8cb9</wsse:KeyIdentifier>
				</wsse:SecurityTokenReference>
			</wst:OnBehalfOf>
			<wst:Issuer>
				<wsa:Address xmlns:wsa="http://www.w3.org/2005/08/addressing">http://saml.saml-perf3.trifork.com</wsa:Address>
			</wst:Issuer>
			<wst:Claims Dialect="dk:gov:saml:OCESAttributeProfile" />
		</wst:RequestSecurityToken>
	</soap11:Body>
</soap11:Envelope>